2022-01-23 13:57:19.933709: F tensorflow/stream_executor/cuda/cuda_dnn.cc:573] Check failed: cudnnSetTensorNdDescriptor(handle_.get(), elem_type, nd, dims.data(), strides.data()) == CUDNN_STATUS_SUCCESS (9 vs. 0)batch_descriptor: {count: 16 feature_map_count: 64 spatial: 1280 1920  value_min: 0.000000 value_max: 0.000000 layout: BatchDepthYX}
Aborted (core dumped)

----------------------------------------------------------------------------------------

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 1280, 1920, 3)]   0         
_________________________________________________________________
block1_conv1 (Conv2D)        (None, 1280, 1920, 64)    1792      
_________________________________________________________________
block1_conv2 (Conv2D)        (None, 1280, 1920, 64)    36928     
_________________________________________________________________
block1_pool (MaxPooling2D)   (None, 640, 960, 64)      0         
_________________________________________________________________
block2_conv1 (Conv2D)        (None, 640, 960, 128)     73856     
_________________________________________________________________
block2_conv2 (Conv2D)        (None, 640, 960, 128)     147584    
_________________________________________________________________
block2_pool (MaxPooling2D)   (None, 320, 480, 128)     0         
_________________________________________________________________
block3_conv1 (Conv2D)        (None, 320, 480, 256)     295168    
_________________________________________________________________
block3_conv2 (Conv2D)        (None, 320, 480, 256)     590080    
_________________________________________________________________
block3_conv3 (Conv2D)        (None, 320, 480, 256)     590080    
_________________________________________________________________
block3_pool (MaxPooling2D)   (None, 160, 240, 256)     0         
_________________________________________________________________
block4_conv1 (Conv2D)        (None, 160, 240, 512)     1180160   
_________________________________________________________________
block4_conv2 (Conv2D)        (None, 160, 240, 512)     2359808   
_________________________________________________________________
block4_conv3 (Conv2D)        (None, 160, 240, 512)     2359808   
_________________________________________________________________
conv2d (Conv2D)              (None, 160, 240, 256)     1179904   
_________________________________________________________________
elu (ELU)                    (None, 160, 240, 256)     0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 160, 240, 256)     590080    
_________________________________________________________________
elu_1 (ELU)                  (None, 160, 240, 256)     0         
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 80, 240, 256)      0         
_________________________________________________________________
dropout (Dropout)            (None, 80, 240, 256)      0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 80, 240, 256)      590080    
_________________________________________________________________
elu_2 (ELU)                  (None, 80, 240, 256)      0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 80, 240, 256)      590080    
_________________________________________________________________
elu_3 (ELU)                  (None, 80, 240, 256)      0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 40, 240, 256)      0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 40, 240, 256)      0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 40, 240, 256)      590080    
_________________________________________________________________
elu_4 (ELU)                  (None, 40, 240, 256)      0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 40, 240, 256)      590080    
_________________________________________________________________
elu_5 (ELU)                  (None, 40, 240, 256)      0         
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 20, 240, 256)      0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 20, 240, 256)      0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 20, 240, 256)      590080    
_________________________________________________________________
elu_6 (ELU)                  (None, 20, 240, 256)      0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 20, 240, 256)      590080    
_________________________________________________________________
elu_7 (ELU)                  (None, 20, 240, 256)      0         
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 10, 240, 256)      0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 10, 240, 256)      0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 8, 240, 2048)      1574912   
_________________________________________________________________
elu_8 (ELU)                  (None, 8, 240, 2048)      0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 8, 240, 2048)      12584960  
_________________________________________________________________
elu_9 (ELU)                  (None, 8, 240, 2048)      0         
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 8, 240, 2048)      4196352   
_________________________________________________________________
elu_10 (ELU)                 (None, 8, 240, 2048)      0         
_________________________________________________________________
dropout_4 (Dropout)          (None, 8, 240, 2048)      0         
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 4, 240, 2048)      0         
_________________________________________________________________
elu_11 (ELU)                 (None, 4, 240, 2048)      0         
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 2, 240, 2048)      0         
_________________________________________________________________
elu_12 (ELU)                 (None, 2, 240, 2048)      0         
_________________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, 1, 240, 2048)      0         
_________________________________________________________________
elu_13 (ELU)                 (None, 1, 240, 2048)      0         
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 1, 240, 160)       327840    
_________________________________________________________________
reshape (Reshape)            (None, 240, 160)          0         
=================================================================
Total params: 31,629,792
Trainable params: 31,629,792
Non-trainable params: 0
